In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [8]:
df = pd.read_csv('E:/All Project/salary_prediction/data/raw/web_data.csv')

In [9]:
df.head()

,company_names,allas,company_reviews
0,TCS,1.1L Reviews9.8L Salaries11.8k Interviews2.2k ...,3.3
1,Accenture,71.3k Reviews6.5L Salaries9.2k Interviews42k J...,3.7
2,Wipro,63.5k Reviews4.8L Salaries6.7k Interviews5.8k ...,3.6
3,Cognizant,59.8k Reviews6L Salaries6.3k Interviews751 Job...,3.6
4,Capgemini,51.5k Reviews4.8L Salaries5.4k Interviews1.9k ...,3.7

In [4]:
df[df.duplicated()]

Empty DataFrame
Columns: [company_names, allas, company_reviews]
Index: []

In [5]:
df.drop_duplicates(inplace=True)

In [6]:
def drop_duplicates(data):
    df = data.drop_duplicates(inplace=True)
    return df

In [7]:
df.head()

,company_names,allas,company_reviews
0,TCS,1.1L Reviews9.7L Salaries11.8k Interviews1.8k ...,3.3
1,Accenture,71.2k Reviews6.5L Salaries9.1k Interviews30.9k...,3.7
2,Wipro,63.5k Reviews4.8L Salaries6.6k Interviews7.8k ...,3.6
3,Cognizant,59.8k Reviews6L Salaries6.3k Interviews674 Job...,3.6
4,Capgemini,51.3k Reviews4.7L Salaries5.4k Interviews1.8k ...,3.7

In [10]:
df['allas'][0]

'1.1L Reviews9.8L Salaries11.8k Interviews2.2k Jobs10.6k Benefits93 Photos'

In [11]:
df['allas'].str.split(' ')[0]

['1.1L',
 'Reviews9.8L',
 'Salaries11.8k',
 'Interviews2.2k',
 'Jobs10.6k',
 'Benefits93',
 'Photos']

In [12]:
Reviews = df['allas'].str.split('Reviews').str[0]
Salaries =df['allas'].str.split(' ').str[1].str.split('Reviews').str[1]
Interviews = df['allas'].str.split(' ').str[2].str.split('Salaries').str[1]
jobs = df['allas'].str.split(' ').str[3].str.split('Interviews').str[1]
Benefits = df['allas'].str.split(' ').str[4].str.split('Jobs').str[1]
photos = df['allas'].str.split(' ').str[5].str.split('Benefits').str[1]

In [13]:
def data_corect(df):
    df['Reviews'] = df['allas'].str.split('Reviews').str[0]
    df['Salaries'] = df['allas'].str.split(' ').str[1].str.split('Reviews').str[1]
    df['Interviews'] = df['allas'].str.split(' ').str[2].str.split('Salaries').str[1]
    df['jobs'] = df['allas'].str.split(' ').str[3].str.split('Interviews').str[1]
    df['Benefits'] = df['allas'].str.split(' ').str[4].str.split('Jobs').str[1]
    df['photos'] = df['allas'].str.split(' ').str[5].str.split('Benefits').str[1]
    df.drop(columns='allas',inplace=True)

    return df

In [14]:
data_corect(df)

,company_names,company_reviews,Reviews,Salaries,Interviews,jobs,Benefits,photos
0,TCS,3.3,1.1L,9.8L,11.8k,2.2k,10.6k,93
1,Accenture,3.7,71.3k,6.5L,9.2k,42k,6.7k,49
2,Wipro,3.6,63.5k,4.8L,6.7k,5.8k,4.6k,107
3,Cognizant,3.6,59.8k,6L,6.3k,751,5.5k,86
4,Capgemini,3.7,51.5k,4.8L,5.4k,1.9k,3.7k,42
...,...,...,...,...,...,...,...,...
9955,Brightsun Travel,2.8,107,479,6,11,9,--
9956,Swami Vivekanand Subharti University,3.7,107,292,2,1,11,9
9957,The AEC Associates,4.5,107,187,14,3,5,8
9958,Shindengen,3.8,107,572,6,--,6,--
9959,Sherweb,3.0,108,213,10,2,1,--

In [2]:

df = pd.read_csv('E:/All Project/salary_prediction/data/harf_prose/test.csv')

In [3]:
df.head()

,company_names,company_reviews,Reviews,Salaries,Interviews,jobs,Benefits,photos
0,Speridian Technologies,3.4,434,3.1k,51,21,21,--
1,Adhunik Metaliks,3.4,147,475,5,--,12,--
2,Halonix Technologies,3.7,340,1.3k,17,2,26,1
3,Bnk Power Solution,3.7,108,370,7,3,6,--
4,XL Dynamics,3.4,1.5k,3.6k,96,4,193,1

In [4]:
df[df['company_names']=='TCS']

,company_names,company_reviews,Reviews,Salaries,Interviews,jobs,Benefits,photos
80,TCS,3.3,1.1L,9.8L,11.8k,2.2k,10.6k,93

In [5]:
df['company_names'].value_counts()

company_names
Speridian Technologies            1
Antara Senior Care                1
Vertiv                            1
Gleeds Hooloomann Consulting      1
Sasken                            1
                                 ..
Ocrolus East                      1
Hiranandani Financial Services    1
Livguard                          1
JK Organisation                   1
Wildcraft                         1
Name: count, Length: 1902, dtype: int64

In [6]:
df.head()

,company_names,company_reviews,Reviews,Salaries,Interviews,jobs,Benefits,photos
0,Speridian Technologies,3.4,434,3.1k,51,21,21,--
1,Adhunik Metaliks,3.4,147,475,5,--,12,--
2,Halonix Technologies,3.7,340,1.3k,17,2,26,1
3,Bnk Power Solution,3.7,108,370,7,3,6,--
4,XL Dynamics,3.4,1.5k,3.6k,96,4,193,1

In [7]:
df.drop(columns='company_names',inplace=True)

In [8]:

df.head()

   company_reviews Reviews Salaries Interviews jobs Benefits photos
0              3.4    434      3.1k         51   21       21     --
1              3.4    147       475          5   --       12     --
2              3.7    340      1.3k         17    2       26      1
3              3.7    108       370          7    3        6     --
4              3.4   1.5k      3.6k         96    4      193      1

In [9]:
df['company_reviews'].value_counts().sort_index()

company_reviews
1.3      1
2.0      1
2.1      2
2.2      1
2.3      3
2.4      1
2.5      4
2.6     13
2.7     13
2.8     25
2.9     21
3.0     37
3.1     47
3.2     66
3.3     73
3.4    110
3.5    134
3.6    170
3.7    177
3.8    214
3.9    202
4.0    195
4.1    152
4.2     97
4.3     47
4.4     36
4.5     28
4.6     10
4.7     11
4.8      5
4.9      6
Name: count, dtype: int64

In [10]:
a = []
for i in df['company_reviews']:
    if i > 4:
        a.append('excellent')
    elif i < 4 and i > 3:
        a.append('good')
    else:
        a.append('Poor')

In [11]:
pd.DataFrame(a).value_counts()

0
good         1193
excellent     392
Poor          317
Name: count, dtype: int64

In [12]:
df['company_reviews'].value_counts()

company_reviews
3.8    214
3.9    202
4.0    195
3.7    177
3.6    170
4.1    152
3.5    134
3.4    110
4.2     97
3.3     73
3.2     66
3.1     47
4.3     47
3.0     37
4.4     36
4.5     28
2.8     25
2.9     21
2.7     13
2.6     13
4.7     11
4.6     10
4.9      6
4.8      5
2.5      4
2.3      3
2.1      2
2.2      1
1.3      1
2.0      1
2.4      1
Name: count, dtype: int64

In [13]:
# change compay reviews in to catogorical data
def change_into_cat(df):
    a = []
    for i in df['company_reviews']:
        if i > 4:
            a.append('excellent')
        elif i < 4 and i > 3:
            a.append('good')
        else:
            a.append('Poor') 
    df['company_reviews'] = a

    return df

In [14]:
df = change_into_cat(df)

In [15]:
df.head()

  company_reviews Reviews Salaries Interviews jobs Benefits photos
0            good    434      3.1k         51   21       21     --
1            good    147       475          5   --       12     --
2            good    340      1.3k         17    2       26      1
3            good    108       370          7    3        6     --
4            good   1.5k      3.6k         96    4      193      1

In [16]:
df['Reviews'].unique()

array(['434 ', '147 ', '340 ', '108 ', '1.5k ', '140 ', '112 ', '241 ',
       '248 ', '324 ', '1.8k ', '161 ', '1.1k ', '143 ', '123 ', '182 ',
       '111 ', '220 ', '302 ', '303 ', '242 ', '158 ', '576 ', '448 ',
       '488 ', '348 ', '213 ', '526 ', '157 ', '258 ', '118 ', '685 ',
       '107 ', '168 ', '283 ', '228 ', '703 ', '191 ', '264 ', '162 ',
       '263 ', '237 ', '150 ', '443 ', '114 ', '187 ', '1.7k ', '334 ',
       '266 ', '307 ', '230 ', '163 ', '119 ', '130 ', '704 ', '895 ',
       '781 ', '473 ', '177 ', '259 ', '393 ', '407 ', '2.4k ', '397 ',
       '2.5k ', '136 ', '165 ', '59.8k ', '375 ', '171 ', '243 ', '1.1L ',
       '435 ', '233 ', '820 ', '288 ', '308 ', '737 ', '437 ', '903 ',
       '299 ', '172 ', '184 ', '192 ', '129 ', '223 ', '131 ', '681 ',
       '332 ', '144 ', '179 ', '122 ', '169 ', '206 ', '219 ', '134 ',
       '2.7k ', '189 ', '149 ', '215 ', '515 ', '124 ', '1.6k ', '539 ',
       '3.3k ', '502 ', '786 ', '148 ', '1.9k ', '224 ', '337 ', '176 ',
       '353 ', '203 ', '183 ', '244 ', '461 ', '218 ', '226 ', '595 ',
       '5k ', '5.7k ', '240 ', '164 ', '110 ', '245 ', '178 ', '251 ',
       '653 ', '249 ', '758 ', '12.3k ', '391 ', '127 ', '2k ', '467 ',
       '139 ', '132 ', '378 ', '372 ', '921 ', '210 ', '549 ', '211 ',
       '185 ', '829 ', '173 ', '115 ', '145 ', '2.1k ', '590 ', '608 ',
       '1.4k ', '383 ', '870 ', '355 ', '398 ', '125 ', '116 ', '195 ',
       '156 ', '170 ', '256 ', '117 ', '121 ', '410 ', '374 ', '373 ',
       '438 ', '698 ', '154 ', '188 ', '587 ', '293 ', '133 ', '137 ',
       '196 ', '377 ', '419 ', '190 ', '777 ', '634 ', '200 ', '751 ',
       '14k ', '523 ', '629 ', '1.3k ', '783 ', '347 ', '400 ', '319 ',
       '174 ', '120 ', '321 ', '198 ', '1k ', '142 ', '388 ', '279 ',
       '947 ', '844 ', '963 ', '344 ', '696 ', '3.2k ', '626 ', '229 ',
       '253 ', '284 ', '402 ', '538 ', '931 ', '217 ', '411 ', '4.3k ',
       '3.1k ', '278 ', '675 ', '201 ', '181 ', '9.3k ', '392 ', '138 ',
       '342 ', '668 ', '320 ', '660 ', '900 ', '155 ', '371 ', '285 ',
       '930 ', '236 ', '262 ', '678 ', '9.5k ', '338 ', '239 ', '609 ',
       '113 ', '875 ', '153 ', '126 ', '167 ', '949 ', '428 ', '128 ',
       '214 ', '5.5k ', '304 ', '339 ', '449 ', '772 ', '268 ', '6.4k ',
       '648 ', '370 ', '390 ', '2.2k ', '386 ', '2.9k ', '141 ', '368 ',
       '261 ', '497 ', '159 ', '309 ', '180 ', '235 ', '252 ', '354 ',
       '231 ', '486 ', '598 ', '641 ', '290 ', '326 ', '512 ', '356 ',
       '265 ', '387 ', '109 ', '667 ', '493 ', '282 ', '901 ', '7k ',
       '7.2k ', '445 ', '409 ', '658 ', '736 ', '360 ', '166 ', '202 ',
       '499 ', '379 ', '456 ', '151 ', '395 ', '341 ', '323 ', '684 ',
       '490 ', '301 ', '474 ', '6.2k ', '842 ', '238 ', '327 ', '367 ',
       '468 ', '152 ', '199 ', '205 ', '333 ', '291 ', '856 ', '961 ',
       '622 ', '551 ', '423 ', '221 ', '364 ', '457 ', '1.2k ', '13.8k ',
       '965 ', '2.6k ', '216 ', '225 ', '645 ', '643 ', '146 ', '376 ',
       '6.1k ', '267 ', '250 ', '401 ', '396 ', '693 ', '316 ', '275 ',
       '4.8k ', '160 ', '25.3k ', '412 ', '417 ', '701 ', '222 ', '276 ',
       '471 ', '732 ', '962 ', '466 ', '727 ', '2.3k ', '487 ', '647 ',
       '352 ', '3.6k ', '204 ', '603 ', '742 ', '300 ', '495 ', '306 ',
       '277 ', '193 ', '271 ', '255 ', '984 ', '902 ', '281 ', '40.9k ',
       '358 ', '444 ', '429 ', '583 ', '408 ', '880 ', '801 ', '819 ',
       '287 ', '674 ', '761 ', '532 ', '569 ', '345 ', '980 ', '767 ',
       '349 ', '489 ', '591 ', '601 ', '650 ', '315 ', '655 ', '592 ',
       '212 ', '496 ', '517 ', '186 ', '728 ', '135 ', '798 ', '175 ',
       '3.4k ', '462 ', '322 ', '809 ', '269 ', '718 ', '194 ', '616 ',
       '286 ', '669 ', '208 ', '503 ', '2.8k ', '525 ', '989 ', '365 ',
       '973 ', '775 ', '944 ', '280 ', '845 ', '21.9k ', '605 ', '405 ',
       '956 ', '363 ', '999 ', '784 ', '298 ', '209 ', '328 ', '421 ',
       '31.5k ', '540 ', '510 ', '418 ', '335 ', '254 ', '600 ', '234 ',
       '257 ', '389 ', '563 ', '527 ', '8.4k ', '406 ', '863 ', '596 ',
       '544 ', '472 ', '828 ', '713 ', '899 ', '292 ', '747 ', '425 ',
       '446 ', '584 ', '500 ', '260 ', '4.5k ', '4k ', '439 ', '464 ',
       '739 ', '624 ', '420 ', '891 ', '197 ', '32.5k ', '12.1k ', '679 ',
       '599 ', '672 ', '740 ', '665 ', '491 ', '294 ', '481 ', '463 ',
       '289 ', '639 ', '498 ', '380 ', '404 ', '896 ', '559 ', '227 ',
       '604 ', '974 ', '501 ', '702 ', '918 ', '4.6k ', '436 ', '756 ',
       '628 ', '27k ', '246 ', '416 ', '273 ', '945 ', '318 ', '796 ',
       '799 ', '459 ', '455 ', '666 ', '451 ', '476 ', '311 ', '247 ',
       '975 ', '3.5k ', '606 ', '5.6k ', '460 ', '5.8k ', '458 ', '399 ',
       '857 ', '977 ', '44.5k ', '5.9k ', '711 ', '343 ', '274 ', '385 ',
       '670 ', '982 ', '346 ', '574 ', '431 ', '780 ', '296 ', '550 ',
       '350 ', '351 ', '763 ', '568 ', '552 ', '232 ', '919 ', '506 ',
       '764 ', '519 ', '610 ', '565 ', '649 ', '3.8k ', '843 ', '859 ',
       '382 ', '9.7k ', '825 ', '722 ', '452 ', '3.7k ', '470 ', '607 ',
       '305 ', '841 ', '317 ', '270 ', '207 ', '312 ', '887 ', '545 ',
       '928 ', '329 ', '619 ', '688 ', '636 ', '504 ', '520 ', '362 '],
      dtype=object)

In [18]:
a = []
def replace(data):

SyntaxError: incomplete input (758957091.py, line 3)

In [19]:
a = ['434 ', '147 ', '340 ', '108 ', '1.5k ', '140 ', '112 ', '241 ',
       '248 ', '324 ', '1.8k ', '161 ', '1.1k ', '143 ', '123 ', '182 ',
       '111 ', '220 ', '302 ', '303 ', '242 ', '158 ', '576 ', '448 ',
       '488 ', '348 ', '213 ', '526 ', '157 ', '258 ', '118 ', '685 ']

In [78]:
for i in a:
    
    print(i)
    print(i[-1])

434

147

340

108

1.5k

140

112

241

248

324

1.8k

161

1.1k

143

123

182

111

220

302

303

242

158

576

448

488

348

213

526

157

258

118

685

In [22]:
df['Reviews'].str.replace('k','').unique()

array(['434 ', '147 ', '340 ', '108 ', '1.5 ', '140 ', '112 ', '241 ',
       '248 ', '324 ', '1.8 ', '161 ', '1.1 ', '143 ', '123 ', '182 ',
       '111 ', '220 ', '302 ', '303 ', '242 ', '158 ', '576 ', '448 ',
       '488 ', '348 ', '213 ', '526 ', '157 ', '258 ', '118 ', '685 ',
       '107 ', '168 ', '283 ', '228 ', '703 ', '191 ', '264 ', '162 ',
       '263 ', '237 ', '150 ', '443 ', '114 ', '187 ', '1.7 ', '334 ',
       '266 ', '307 ', '230 ', '163 ', '119 ', '130 ', '704 ', '895 ',
       '781 ', '473 ', '177 ', '259 ', '393 ', '407 ', '2.4 ', '397 ',
       '2.5 ', '136 ', '165 ', '59.8 ', '375 ', '171 ', '243 ', '1.1L ',
       '435 ', '233 ', '820 ', '288 ', '308 ', '737 ', '437 ', '903 ',
       '299 ', '172 ', '184 ', '192 ', '129 ', '223 ', '131 ', '681 ',
       '332 ', '144 ', '179 ', '122 ', '169 ', '206 ', '219 ', '134 ',
       '2.7 ', '189 ', '149 ', '215 ', '515 ', '124 ', '1.6 ', '539 ',
       '3.3 ', '502 ', '786 ', '148 ', '1.9 ', '224 ', '337 ', '176 ',
       '353 ', '203 ', '183 ', '244 ', '461 ', '218 ', '226 ', '595 ',
       '5 ', '5.7 ', '240 ', '164 ', '110 ', '245 ', '178 ', '251 ',
       '653 ', '249 ', '758 ', '12.3 ', '391 ', '127 ', '2 ', '467 ',
       '139 ', '132 ', '378 ', '372 ', '921 ', '210 ', '549 ', '211 ',
       '185 ', '829 ', '173 ', '115 ', '145 ', '2.1 ', '590 ', '608 ',
       '1.4 ', '383 ', '870 ', '355 ', '398 ', '125 ', '116 ', '195 ',
       '156 ', '170 ', '256 ', '117 ', '121 ', '410 ', '374 ', '373 ',
       '438 ', '698 ', '154 ', '188 ', '587 ', '293 ', '133 ', '137 ',
       '196 ', '377 ', '419 ', '190 ', '777 ', '634 ', '200 ', '751 ',
       '14 ', '523 ', '629 ', '1.3 ', '783 ', '347 ', '400 ', '319 ',
       '174 ', '120 ', '321 ', '198 ', '1 ', '142 ', '388 ', '279 ',
       '947 ', '844 ', '963 ', '344 ', '696 ', '3.2 ', '626 ', '229 ',
       '253 ', '284 ', '402 ', '538 ', '931 ', '217 ', '411 ', '4.3 ',
       '3.1 ', '278 ', '675 ', '201 ', '181 ', '9.3 ', '392 ', '138 ',
       '342 ', '668 ', '320 ', '660 ', '900 ', '155 ', '371 ', '285 ',
       '930 ', '236 ', '262 ', '678 ', '9.5 ', '338 ', '239 ', '609 ',
       '113 ', '875 ', '153 ', '126 ', '167 ', '949 ', '428 ', '128 ',
       '214 ', '5.5 ', '304 ', '339 ', '449 ', '772 ', '268 ', '6.4 ',
       '648 ', '370 ', '390 ', '2.2 ', '386 ', '2.9 ', '141 ', '368 ',
       '261 ', '497 ', '159 ', '309 ', '180 ', '235 ', '252 ', '354 ',
       '231 ', '486 ', '598 ', '641 ', '290 ', '326 ', '512 ', '356 ',
       '265 ', '387 ', '109 ', '667 ', '493 ', '282 ', '901 ', '7 ',
       '7.2 ', '445 ', '409 ', '658 ', '736 ', '360 ', '166 ', '202 ',
       '499 ', '379 ', '456 ', '151 ', '395 ', '341 ', '323 ', '684 ',
       '490 ', '301 ', '474 ', '6.2 ', '842 ', '238 ', '327 ', '367 ',
       '468 ', '152 ', '199 ', '205 ', '333 ', '291 ', '856 ', '961 ',
       '622 ', '551 ', '423 ', '221 ', '364 ', '457 ', '1.2 ', '13.8 ',
       '965 ', '2.6 ', '216 ', '225 ', '645 ', '643 ', '146 ', '376 ',
       '6.1 ', '267 ', '250 ', '401 ', '396 ', '693 ', '316 ', '275 ',
       '4.8 ', '160 ', '25.3 ', '412 ', '417 ', '701 ', '222 ', '276 ',
       '471 ', '732 ', '962 ', '466 ', '727 ', '2.3 ', '487 ', '647 ',
       '352 ', '3.6 ', '204 ', '603 ', '742 ', '300 ', '495 ', '306 ',
       '277 ', '193 ', '271 ', '255 ', '984 ', '902 ', '281 ', '40.9 ',
       '358 ', '444 ', '429 ', '583 ', '408 ', '880 ', '801 ', '819 ',
       '287 ', '674 ', '761 ', '532 ', '569 ', '345 ', '980 ', '767 ',
       '349 ', '489 ', '591 ', '601 ', '650 ', '315 ', '655 ', '592 ',
       '212 ', '496 ', '517 ', '186 ', '728 ', '135 ', '798 ', '175 ',
       '3.4 ', '462 ', '322 ', '809 ', '269 ', '718 ', '194 ', '616 ',
       '286 ', '669 ', '208 ', '503 ', '2.8 ', '525 ', '989 ', '365 ',
       '973 ', '775 ', '944 ', '280 ', '845 ', '21.9 ', '605 ', '405 ',
       '956 ', '363 ', '999 ', '784 ', '298 ', '209 ', '328 ', '421 ',
       '31.5 ', '540 ', '510 ', '418 ', '335 ', '254 ', '600 ', '234 ',
       '257 ', '389 ', '563 ', '527 ', '8.4 ', '406 ', '863 ', '596 ',
       '544 ', '472 ', '828 ', '713 ', '899 ', '292 ', '747 ', '425 ',
       '446 ', '584 ', '500 ', '260 ', '4.5 ', '4 ', '439 ', '464 ',
       '739 ', '624 ', '420 ', '891 ', '197 ', '32.5 ', '12.1 ', '679 ',
       '599 ', '672 ', '740 ', '665 ', '491 ', '294 ', '481 ', '463 ',
       '289 ', '639 ', '498 ', '380 ', '404 ', '896 ', '559 ', '227 ',
       '604 ', '974 ', '501 ', '702 ', '918 ', '4.6 ', '436 ', '756 ',
       '628 ', '27 ', '246 ', '416 ', '273 ', '945 ', '318 ', '796 ',
       '799 ', '459 ', '455 ', '666 ', '451 ', '476 ', '311 ', '247 ',
       '975 ', '3.5 ', '606 ', '5.6 ', '460 ', '5.8 ', '458 ', '399 ',
       '857 ', '977 ', '44.5 ', '5.9 ', '711 ', '343 ', '274 ', '385 ',
       '670 ', '982 ', '346 ', '574 ', '431 ', '780 ', '296 ', '550 ',
       '350 ', '351 ', '763 ', '568 ', '552 ', '232 ', '919 ', '506 ',
       '764 ', '519 ', '610 ', '565 ', '649 ', '3.8 ', '843 ', '859 ',
       '382 ', '9.7 ', '825 ', '722 ', '452 ', '3.7 ', '470 ', '607 ',
       '305 ', '841 ', '317 ', '270 ', '207 ', '312 ', '887 ', '545 ',
       '928 ', '329 ', '619 ', '688 ', '636 ', '504 ', '520 ', '362 '],
      dtype=object)